app/controllers/employees_controller.rb

  def create
    @emp = Employee.new
    #if request is post create a new employee using the parameters
#create an array which consists of all the projects
    pro = Project.find(:all)
    @projects =Array.new
    pro.each do |p|
      @projects << p.name
    end
    if request.post?
      check_for_admin

      if params[:emp][:"date_of_joining(1i)"].blank?
        return flash.now[:msg] = "Please enter a date"
      end
      #convert date to a valid format
      @date = params[:emp][:"date_of_joining(1i)"]+ "-" +  params[:emp][:"date_of_joining(2i)"] + "-" + params[:emp][:"date_of_joining(3i)"]
        begin
          @emp=Employee.new(:first_name => params[:emp][:first_name], :last_name => params[:emp][:last_name],
                                      :email => params[:emp][:email], :date_of_joining => @date.to_date)
        rescue => ex
          return flash.now[:msg] =  "#{ex.class}: #{ex.message}"
        end

      if @emp.save
        hash = rand(1111110000000000000000000).to_s
#add details to the user table
        @newuser=User.new(:confirm_creation_hash => hash, :username => @emp.email,
                          :password => "password1", :employee_id => @emp.id)
        if @newuser.save
---
SELECT * FROM `projects`
INSERT INTO `employees` (`date_of_leaving`, `created_at`, `date_of_joining`, `updated_at`, `last_name`, `first_name`, `email`) VALUES(NULL, '2011-02-02 05:22:31', '2011-02-01 18:30:00', '2011-02-02 05:22:31', 'asdasd', 'asd', 'asdasd@aasdd.com')
INSERT INTO `users` (`salt`, `created_at`, `forgot_password_hash`, `updated_at`, `username`, `hashed_password`, `employee_id`, `is_admin`, `is_active`, `confirm_creation_hash`) VALUES('-6126943780.666740260581082', '2011-02-02 05:22:31', NULL, '2011-02-02 05:22:31', 'asdasd@aasdd.com', 'a9321a8148d72ee560e95d6316c6e5f179698eb1', 1, NULL, 0, '528162737951906599362935')

  def list
#check if users is logged in and is a admin user
    check_for_admin
    @employees = Employee.find(:all)
=begin
    if @employees.blank?
---
SELECT * FROM `employees`