app/controllers/projects_controller.rb

INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `deactivated_at`, `description`) VALUES('asdasd', '2011-02-02 05:22:45', '2011-02-02 05:22:45', NULL, 'asdasdasdasd')
SELECT * FROM `employees`
SELECT * FROM `employees` WHERE (`employees`.`email` = 'asdasd@aasdd.com') LIMIT 1
SELECT `projects`.id FROM `projects` WHERE (`projects`.`name` = BINARY 'asdasd') LIMIT 1
INSERT INTO `employee_projects` (`allocated_at`, `created_at`, `project_id`, `deallocated_at`, `updated_at`, `employee_id`, `employee_name`, `project_name`) VALUES('2011-02-02 10:52:45', '2011-02-02 05:22:45', 1, NULL, '2011-02-02 05:22:45', 1, 'asdasdasd', 'asdasd')
---
    def create
  #show form to add details of project

      #if its a admin user create a new project object on post request
      check_for_admin
      if request.post?

         @project = Project.new(params[:project])#put parameters coming in post request in it
         if @project.save      #make changes in database
           unless params[:employees].blank?
             params[:employees].each do |employee|
               emp = Employee.find_by_email(employee)
               emp_pro = EmployeeProject.new(:employee_id => emp.id, :project_id => @project.id, :employee_name =>
                               emp.first_name + emp.last_name,:project_name => @project.name, :allocated_at => Time.now)
               emp_pro.save

SELECT * FROM `projects` WHERE (`projects`.`id` = '1') LIMIT 1
SELECT * FROM `employee_projects` WHERE (`employee_projects`.`project_name` = 'asdasd') AND (`employee_projects`.project_id = 1) LIMIT 1
---
    def edit
      check_for_admin
      if params[:id]
        @project = Project.find_by_id(params[:id])
      end
      if request.post?
        #if request is post change name and description
        @project.name=params[:change][:name]
        @project.description=params[:change][:description]
        #also change the name of the project from the employees assigned
        a = @project.employee_projects.find_by_project_name(params[:change][:name])

SELECT * FROM `employees` WHERE (`employees`.`id` = '1') LIMIT 1
SELECT * FROM `projects` WHERE (`projects`.`id` = '1') LIMIT 1
---
    def ajax_action
      check_for_admin
      emp = Employee.find_by_id(params[:eid])
      @project = Project.find_by_id(params[:pid])

SELECT * FROM `employee_projects` WHERE (`employee_projects`.`employee_id` IS NULL)
---
    def projects_allocated_to_employee
      @projects = []
      EmployeeProject.find(:all, :conditions => {:employee_id => params[:id]}).each do |e|