app/controllers/timesheets_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`id` IS NULL) LIMIT 1
---
  def create
    user = User.find_by_id(session[:user_id])
    emp = Employee.find_by_id(user.employee_id)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `timesheets` WHERE (`timesheets`.`date` = '2011-02-02')
SELECT * FROM `timesheets` WHERE (`timesheets`.`date` = '2011-02-02' AND `timesheets`.`employee_id` IS NULL)
---
  def view
    @user=User.find_by_id(session[:user_id])
    if @user
#When user logs in show the timesheets for today
      if @user.is_admin
#if user is admin show all timesheets of today
        date =Date.today
        @timesheets = Timesheet.find(:all, :conditions => {:date => date})
      else
#otherwise show timesheets of current user only
        @timesheets = Timesheet.find(:all, :conditions => {:date => Date.today,:employee_id => @user.employee_id})

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def sort_it
    @user = User.find_by_id(session[:user_id])