app/controllers/users_controller.rb

  def home
#if hashes are nil for the user show home page
    @user=User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def change_password
#if user is logged in  create a user object
    @user=User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1